nextgenx/src/main/resources/webservices/response/CashAccountResponseAvaloq.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header/>
  <env:Body>
    <ns3:AvaloqGatewayResponseMsg xmlns:ns3="ns://private.btfin.com/Avaloq/AvaloqGateway/AvaloqGatewayResponse/V1_0">
      <ResponseDetails>
        <SuccessResponse>&lt;?xml version="1.0" encoding="UTF-8" standalone="yes"?&gt;
&lt;rep:report xmlns:rep="http://www.avaloq.com/abs/screen_rep/hira/web_ui_basic_investor" xmlns:repb="http://www.avaloq.com/abs/screen_rep/base"&gt;

  &lt;def&gt;
    &lt;version&gt;1.0&lt;/version&gt;
    &lt;report_def&gt;
      &lt;style&gt;flat&lt;/style&gt;
      &lt;lang id="1"&gt;en&lt;/lang&gt;
      &lt;hira_def&gt;
        &lt;group_list&gt;
        &lt;/group_list&gt;
      &lt;/hira_def&gt;
      &lt;row_def&gt;
        &lt;fld_list&gt;
        &lt;fld_def&gt;
          &lt;name&gt;key&lt;/name&gt;
          &lt;type&gt;textField&lt;/type&gt;
          &lt;label&gt;KEY&lt;/label&gt;
        &lt;/fld_def&gt;
        &lt;fld_def&gt;
          &lt;name&gt;value&lt;/name&gt;
          &lt;type&gt;textField&lt;/type&gt;
          &lt;label&gt;VALUE&lt;/label&gt;
        &lt;/fld_def&gt;

        &lt;/fld_list&gt;
      &lt;/row_def&gt;
    &lt;/report_def&gt;
  &lt;/def&gt;

  &lt;data&gt;
    &lt;report_data&gt;
      &lt;head id="1" rowType="title" hira="0" level="report_data.head"&gt;
          &lt;key&gt;&lt;val&gt;macc_id&lt;/val&gt;&lt;/key&gt;
          &lt;value&gt;&lt;annot&gt;&lt;ctxType&gt;obj_macc&lt;/ctxType&gt;&lt;ctxId&gt;11917&lt;/ctxId&gt;&lt;/annot&gt;&lt;val&gt;Current account AUD 10000001&lt;/val&gt;&lt;/value&gt;
      &lt;/head&gt;
      &lt;head id="2" rowType="title" hira="0" level="report_data.head"&gt;
          &lt;key&gt;&lt;val&gt;person_id&lt;/val&gt;&lt;/key&gt;
          &lt;value&gt;&lt;annot&gt;&lt;ctxType&gt;obj_person&lt;/ctxType&gt;&lt;ctxId&gt;11135&lt;/ctxId&gt;&lt;/annot&gt;&lt;val&gt;Smith Adrian&lt;/val&gt;&lt;/value&gt;
      &lt;/head&gt;
      &lt;head id="3" rowType="title" hira="0" level="report_data.head"&gt;
      &lt;/head&gt;
    &lt;/report_data&gt;

  &lt;/data&gt;
&lt;/rep:report&gt;
</SuccessResponse>
      </ResponseDetails>
    </ns3:AvaloqGatewayResponseMsg>
  </env:Body>
</env:Envelope>



<!--
REQUEST 
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header>
    <ns2:esbHeader xmlns:ns2="http://www.westpac.com.au/gn/utility/xsd/esbHeader/v3/">
      <ns2:messageAttributes>
        <ns2:id>a069cc9e-b28e-401e-95bf-ef05292b6532</ns2:id>
        <ns2:createdTimestamp>2013-05-16T17:46:37.207</ns2:createdTimestamp>
      </ns2:messageAttributes>
      <ns2:channelAttributes>
        <ns2:organisationId>btng</ns2:organisationId>
        <ns2:brandSilo>rubbish</ns2:brandSilo>
        <ns2:channelType>Online</ns2:channelType>
        <ns2:originatingSystemId>NG-001</ns2:originatingSystemId>
      </ns2:channelAttributes>
    </ns2:esbHeader>
  </env:Header>
  <env:Body>
    <ns6:AvaloqGatewayRequestMsg xmlns:ns6="ns://private.btfin.com/Avaloq/AvaloqGateway/AvaloqGatewayRequest/V1_0" xmlns:ns10="http://btfin.com/ABS/TrxService/Inpay/V1_0" xmlns:ns3="ns://btfin.com/Sha
redServices/Common/Payment/PaymentService/PaymentRequest/V1_0" xmlns:ns4="ns://btfin.com/nextgen/services/schemas" xmlns:ns5="urn:uddi-org:api_v2" xmlns:ns7="http://btfin.com/ABS/ReportService/ReportR
equest/V1_0" xmlns:ns8="http://btfin.com/ABS/TrxService/Pay/V1_0" xmlns:ns9="ns://btfin.com/SharedServices/BPM/Image/ImageService/ImageRequest/V1_0" xmlns="">
      <bu_id>7</bu_id>
      <user>7010001</user>
      <op>REP_REQ</op>
      <msg>&lt;?xml version="1.0" encoding="UTF-8" standalone="yes"?&gt;&lt;ns6:rep_req xmlns:ns2="ns://btfin.com/SharedServices/Common/Payment/PaymentService/PaymentRequest/V1_0" xmlns:ns4="urn:uddi-
org:api_v2" xmlns:ns3="ns://btfin.com/nextgen/services/schemas" xmlns:ns9="http://btfin.com/ABS/TrxService/Inpay/V1_0" xmlns:ns5="ns://private.btfin.com/Avaloq/AvaloqGateway/AvaloqGatewayRequest/V1_0"
 xmlns:ns6="http://btfin.com/ABS/ReportService/ReportRequest/V1_0" xmlns:ns7="http://btfin.com/ABS/TrxService/Pay/V1_0" xmlns:ns8="ns://btfin.com/SharedServices/BPM/Image/ImageService/ImageRequest/V1_
0"&gt;&lt;task&gt;&lt;templ&gt;task_afs_config.btfg$custr&lt;/templ&gt;&lt;fmt&gt;xml_specific&lt;/fmt&gt;&lt;/task&gt;&lt;/ns6:rep_req&gt;</msg>
    </ns6:AvaloqGatewayRequestMsg>
  </env:Body>
</env:Envelope>


RESPONSE
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
  <env:Header/>
  <env:Body>
    <ns3:AvaloqGatewayResponseMsg xmlns:ns3="ns://private.btfin.com/Avaloq/AvaloqGateway/AvaloqGatewayResponse/V1_0">
      <ResponseDetails>
        <SuccessResponse>&lt;?xml version="1.0" encoding="UTF-8" standalone="yes"?&gt;
&lt;rep:report xmlns:rep="http://www.avaloq.com/abs/screen_rep/hira/web_ui_basic_investor" xmlns:repb="http://www.avaloq.com/abs/screen_rep/base"&gt;

  &lt;def&gt;
    &lt;version&gt;1.0&lt;/version&gt;
    &lt;report_def&gt;
      &lt;style&gt;flat&lt;/style&gt;
      &lt;lang id="1"&gt;en&lt;/lang&gt;
      &lt;hira_def&gt;
        &lt;group_list&gt;
        &lt;/group_list&gt;
      &lt;/hira_def&gt;
      &lt;row_def&gt;
        &lt;fld_list&gt;
        &lt;fld_def&gt;
          &lt;name&gt;key&lt;/name&gt;
          &lt;type&gt;textField&lt;/type&gt;
          &lt;label&gt;KEY&lt;/label&gt;
        &lt;/fld_def&gt;
        &lt;fld_def&gt;
          &lt;name&gt;value&lt;/name&gt;
          &lt;type&gt;textField&lt;/type&gt;
          &lt;label&gt;VALUE&lt;/label&gt;
        &lt;/fld_def&gt;

        &lt;/fld_list&gt;
      &lt;/row_def&gt;
    &lt;/report_def&gt;
  &lt;/def&gt;

  &lt;data&gt;
    &lt;report_data&gt;
      &lt;head id="1" rowType="title" hira="0" level="report_data.head"&gt;
          &lt;key&gt;&lt;val&gt;macc_id&lt;/val&gt;&lt;/key&gt;
          &lt;value&gt;&lt;annot&gt;&lt;ctxType&gt;obj_macc&lt;/ctxType&gt;&lt;ctxId&gt;11917&lt;/ctxId&gt;&lt;/annot&gt;&lt;val&gt;Current account AUD 10000001&lt;/val&gt;&lt;/value&gt;
      &lt;/head&gt;
      &lt;head id="2" rowType="title" hira="0" level="report_data.head"&gt;
          &lt;key&gt;&lt;val&gt;person_id&lt;/val&gt;&lt;/key&gt;
          &lt;value&gt;&lt;annot&gt;&lt;ctxType&gt;obj_person&lt;/ctxType&gt;&lt;ctxId&gt;11135&lt;/ctxId&gt;&lt;/annot&gt;&lt;val&gt;Smith Adrian&lt;/val&gt;&lt;/value&gt;
      &lt;/head&gt;
      &lt;head id="3" rowType="title" hira="0" level="report_data.head"&gt;
      &lt;/head&gt;
    &lt;/report_data&gt;

  &lt;/data&gt;
&lt;/rep:report&gt;
</SuccessResponse>
      </ResponseDetails>
    </ns3:AvaloqGatewayResponseMsg>
  </env:Body>
</env:Envelope> -->